
copyBtn = document.querySelector(".copy"),
facebookBtn = document.querySelector(".facebook"),
twitterBtn = document.querySelector(".twitter");

let quotes = [
    "Но... стига ми тая награда - да каже нявга народът: умря сиромах за правда, за правда и за свобода... - Христо Ботев",
    "Ако спечеля, печеля за цял народ - ако загубя, губя само мене си.   - Васил Левски",
    "Българио, за тебе те умряха, една бе ти достойна зарад тях, и те за теб достойни, майко бяха. И твойто име само кат мълвяха, умираха без страх.   - Иван Вазов",
    "Няма власт над оная глава, която е готова да се отдели от плещите си в името на свободата и за благото на цялото човечество.“ – Христо Ботев",
    "Опознай Родината, за да я обикнеш! - Алеко Константинов",
    "Нека всеки запише дълбоко в сърцето си: свобода или смърт!   - Георги Раковски",
    "Като народ ние можем да се гордеем, че всичките ни народни деятели и патриоти: Г.Раковски, Л.Каравелов, В.Левски, Хр.Ботйов, А.Кънчев, П.Волов, Г.Бенковски и проч., са биле против официална Русия. Никога те не са апелирали към нея, защото са знаяли, че нейний камшик повече боли от турския. - Захари Стоянов",
    "Ако трябва да умрем, всички ще умрем под развалините на България!   - Стефан Стамболов",
    "Главата ми да отсекат, пак ще викам: Да живее България! - Николай Хайтов",
    "Аз съм се посветил на отечеството си жертва за освобождението му, а не да бъда кой знае какъв. - Васил Левски",
    "Няма власт над оная глава, която е готова да се отдели от плещите си в името на свободата и за благото на цялото отечество. - Христо Ботев",
    "Предателите на Отечеството не заслужават милост. - Стефан Стамболов",
    "Знай, че после отечеството си съм обичал най-много тебе. (из писмо до жена си) - Христо Ботев",
    "Ще имаме едно знаме, на което ще пише: Свята и чиста република. - Васил Левски",
    "Изтървем ли България, изтървали сме всичко. - Николай Хайтов",
    "Играем с живота на 7 милиона българи - трябва зряло да се постъпва. - Васил Левски",
    "Силата и вярата са били две главни условия, необходими за да живее кой да е народ – Васил Друмев",
    "Само надеждата ми, че ще мога и аз да участвам в преуспяването и величието на отечеството ми, ме прави да умра спокойно. – Евлоги Георгиев",
    "Който копае трап другиму, той сам пада в него и който се лакоми да вземе чуждото с правда, ще изгуби и своето си. – Илия Блъсков",
    "Обичай Отечеството си, нито да пожелаеш друго Отечество, освен него, защото такова желание вменява се началото на предателство. – Неофит Рилски",
    "Можете да сте господари на всичко или роби на всички – от вас зависи. Ама по между си не градете толкоз дувари, дето да ви делят, ами повече мостове – да ви събират! – Никола Фичев",
    "О, неразумний юроде! Поради что се срамуваш да се наречеш българин и не четеш, и не говориш на своя език?” – Паисий Хилендарски",
    "Никой народ на този свят не може без  патриоти и предатели. – Петко Франгов",
    "Време е да започнем да ценим и почитаме себе си, та тогава да чакаме да добием почит и от други народи. – Сава Филаретов",
    "Поробен народ се освобождава, разпокъсан народ не се обединява. – Д-р Стоян Чомаков",
    "Българинът ще стане велик гражданин на света в деня, когато зареже най-долното си качество – винаги да гледа да мине тънко и да не си плати справедливо за това, което получава. – Атанас Буров",
    "Ако трябва да паднем, нека паднем с чест! – Богдан Филов",
    "Държавният мъж трябва да има само една страст, и тая страст му е присъща, тя е първата му отличителна черта – тя е страстта към общественото благо. – Велчо Т. Велчев",
    "Едно правителство, било то консервативно, било то либерално, трябва най-първо да има един политически морал. – Драган Цанков",
    "Ние българите сме страшно привързани към земята и емигрантския живот е много тежък за нас. – Константин Величков",
    "Историята прилича на тояга в ръцете на слепеца. – Д-р Петър Гудев",
    "България има нужда от фабрики. Но не да създават пролетариат, а да създават заможни хора. Само заможният човек, независимият и сигурен в хляба си човек купува книги, чете, мисли, образова се и учи децата си. – Янко Сакъзов",

];


btn.addEventListener('click', function(){
    var randomQuote = quotes[Math.floor(Math.random() * quotes.length)]
    quote.innerHTML = randomQuote;
})

copyBtn.addEventListener("click", ()=>{
    navigator.clipboard.writeText(quote.innerHTML)
});

twitterBtn.addEventListener("click", ()=>{
    let tweetUrl = `https://twitter.com/intent/tweet?url=${quote.innerHTML}`;
    window.open(tweetUrl, "_blank");
});