const generateQuote = function() {
    const quotes = [
    {
        quote: "Но... стига ми тая награда - да каже нявга народът: умря сиромах за правда, за правда и за свобода...",
        author: "Христо Ботев"
    },
    {
        quote: "Ако спечеля, печеля за цял народ - ако загубя, губя само мене си.",
        author: "Васил Левски"
    },
    {
        quote: "Българио, за тебе те умряха, една бе ти достойна зарад тях, и те за теб достойни, майко бяха. И твойто име само кат мълвяха, умираха без страх.",
        author: "Иван Вазов"
    },
    {
        quote: "Няма власт над оная глава, която е готова да се отдели от плещите си в името на свободата и за благото на цялото човечество.",
        author: "Христо Ботев"
    },
    {
        quote: "Опознай Родината, за да я обикнеш!",
        author: "Алеко Константинов"
    },
    {
        quote: "Нека всеки запише дълбоко в сърцето си: свобода или смърт!",
        author: "Георги Раковски"
    },
    {    quote: "Като народ ние можем да се гордеем, че всичките ни народни деятели и патриоти: Г.Раковски, Л.Каравелов, В.Левски, Хр.Ботйов, А.Кънчев, П.Волов, Г.Бенковски и проч., са биле против официална Русия. Никога те не са апелирали към нея, защото са знаяли, че нейний камшик повече боли от турския.",
        author: "Захари Стоянов"
    },
    {
        quote: "Ако трябва да умрем, всички ще умрем под развалините на България!",
        author: "Стефан Стамболов"
    },
    {
        quote: "Знай, че после отечеството си съм обичал най-много тебе. (из писмо до жена си)",
        author: "Христо Ботев"
    },
    {
        quote: "Ще имаме едно знаме, на което ще пише: Свята и чиста република.",
        author: "Васил Левски"
    },
    {
        quote: "Изтървем ли България, изтървали сме всичко.",
        author: "Николай Хайтов"
    },
    {
        quote: "Играем с живота на 7 милиона българи - трябва зряло да се постъпва.",
        author: "Васил Левски"
    },
    {
        quote: "Силата и вярата са били две главни условия, необходими за да живее кой да е народ.",
        author: "Васил Друмев"
    },
    {
        quote: "Само надеждата ми, че ще мога и аз да участвам в преуспяването и величието на отечеството ми, ме прави да умра спокойно.",
        author: "Евлоги Георгиев"
    },
    {
        quote: "Който копае трап другиму, той сам пада в него и който се лакоми да вземе чуждото с правда, ще изгуби и своето си.",
        author: "Илия Блъсков"
    },
    {
        quote: "Обичай Отечеството си, нито да пожелаеш друго Отечество, освен него, защото такова желание вменява се началото на предателство.",
        author: "Неофит Рилски"
    },
    {
        quote: "Можете да сте господари на всичко или роби на всички – от вас зависи. Ама по между си не градете толкоз дувари, дето да ви делят, ами повече мостове – да ви събират!",
        author: "Никола Фичев"
    },
    {
        quote: "О, неразумний юроде! Поради что се срамуваш да се наречеш българин и не четеш, и не говориш на своя език?",
        author: "Паисий Хилендарски"
    },
    {
        quote: "Никой народ на този свят не може без  патриоти и предатели.",
        author: "Петко Франгов"
    },
    {
        quote: "Време е да започнем да ценим и почитаме себе си, та тогава да чакаме да добием почит и от други народи.",
        author: "Сава Филаретов"
    },
    {
        quote: "Поробен народ се освобождава, разпокъсан народ не се обединява.",
        author: "Д-р Стоян Чомаков"
    },
    {
        quote: "Българинът ще стане велик гражданин на света в деня, когато зареже най-долното си качество – винаги да гледа да мине тънко и да не си плати справедливо за това, което получава.",
        author: "Атанас Буров"
    },
    {
        quote: "Ако трябва да паднем, нека паднем с чест!",
        author: "Богдан Филов"
    },
    {
        quote: "Държавният мъж трябва да има само една страст, и тая страст му е присъща, тя е първата му отличителна черта – тя е страстта към общественото благо.",
        author: "Велчо Т. Велчев"
    },
    {
        quote: "Едно правителство, било то консервативно, било то либерално, трябва най-първо да има един политически морал.",
        author: "Драган Цанков"
    },
    {
        quote: "Ние българите сме страшно привързани към земята и емигрантския живот е много тежък за нас.",
        author: "Константин Величков"
    },
    {
        quote: "Историята прилича на тояга в ръцете на слепеца.",
        author: "Д-р Петър Гудев"
    },
    {
        quote: "България има нужда от фабрики. Но не да създават пролетариат, а да създават заможни хора. Само заможният човек, независимият и сигурен в хляба си човек купува книги, чете, мисли, образова се и учи децата си.",
        author: "Янко Сакъзов"
    },
    {
        quote: "Министрите ми са англофили, генералите - германофили, моят народ е русофилски, само аз останах българофил.",
        author: "Цар Борис III"
    },
    {
        quote: "По-добре черен хляб отколкото черни забрадки. (при среща със селяни в софийско 1942г.)",
        author: "Цар Борис III"
    },
    {
        quote: "Наш дълг, дълг на всинца ни, от най-малкия до най-големия, е да запазим и засилим единството. Неговият стимул е безграничната любов към Родината, която живее през поколенията. Но нека, изпълнявайки дълга си, бъдем сплотени в името на онова, което остава след нас и което трябва да бъде наш култ – Отечеството.",
        author: "Цар Борис III"
    },
    {
        quote: "Под своите бойни знамена, скромните, но велики по дух български воини изпълниха вярно и самоотвержено върховния си дълг към Отечеството. Под тях те жънеха неведома слава, но не лично за себе си, а за българското име",
        author: "Цар Борис III"
    },
    {
        quote: "Моят народ се бие само на Балканите, където има етнически наши земи, не може да се бие на други фронтове или в Африка, ако се прати наша войска на Волга тя ще мине на страната на руснаците заедно с музиката",
        author: "Цар Борис III"
    },
    {
        quote: "Звездата на България не е залязла, тя няма да залезе!",
        author: "Цар Борис III"
    },
    {
        quote: "Целта ни в Българско е братство с всекиго, без да гледаме на вяра и народност; ръката си подаваме всекиму, който желае да пролива кръв с нас заедно за живот и свобода човешка.",
        author: "Васил Левски"
    },
    {
        quote: "От никоя страна нищо не се надяваме и никому за нищо не се молим. Всичко се състои според нас в нашите задружни сили. Против тях не може противостоя и най-силната стихия.",
        author: "Васил Левски"
    },
    {
        quote: "И ние сме хора и искаме да живеем човешки: да бъдем напълно свободни в земята си, там гдето живее българинът – в България, Тракия и Македония.",
        author: "Васил Левски"
    },
    {
        quote: "Ние смe българи и всeкога работим и ще работим за обединението на българския народ.",
        author: "Даме Груев"
    },
    {
        quote: "Науката е светилото на един народ, литературата е животът му.",
        author: "Иван Вазов"
    },
    {
        quote: "Ние сме малка държава, бедна на природни богатства, но добрият ни народ е неоценимо богатство. Повярвайте ми: по-дивна, по-прекрасна, по-нежна страна от България няма! Дори бедни да сте, работете за нея. Тук умрете. Тя е земята, която ви храни и закриля, заклевам ви, никога не я изоставяйте!”",
        author: "Атанас Буров"
    },
    {
        quote: "Придобвиките в областта на културата са често пъти много по-важни и много по-ценни за един народ, отколкото придобивките в областта на политиката",
        author: "Богдан Филов"
    },
    {
        quote: "Бъди строг, но най-първо и най-много към себе си!",
        author: "Борис Дрангов"
    },
    {
        quote: "Човек е роб на свойта воля, но господар на свойто дело.",
        author: "Борис Дрангов"
    },
    {
        quote: "В смъртта няма нищо страшно, защото е сладко да се мре за България.",
        author: "Борис Дрангов"
    },
    {
        quote: "Две смърти няма, без една не може!",
        author: "Борис Дрангов"
    },
    {
        quote: "Животът не се мери по дължина, а по съдържание.",
        author: "Борис Дрангов"
    },
    {
        quote: "Изплашеният е полуразбит.",
        author: "Борис Дрангов"
    },
    {
        quote: "Колкото и да ни струва победата, всякога поражението ще ни струва повече.",
        author: "Борис Дрангов"
    },
    {
        quote: "България е благословена страна! Неслучайно Силите ме изпратиха тук.",
        author: "Ванга"
    },
    {
        quote: "Аз не съм песимист.Аз съм дълбоко убеден ,че каузата на България не е изгубена и бих желал да вдъхна във вас същата вяра.",
        author: "Атанас Буров"
    },
    {
        quote: "Въобще българинът и по-специално селската маса поради вековното робство под турците, е свикнала всеки да разчита на себе си. Българинът е станал ценен като личност, но слаб за всяка обща акция…",
        author: "Атанас Буров"
    },
    {
        quote: "Трябва да възпитаме децата на България в свещена омраза против лъжата и безчестието. Само върху тази здрава основа ще изградим бъдещето на България.",
        author: "Атанас Буров"
    },
    {
        quote: "Аз намирам смисъла на човешкия живот не в неговата продължителност, а в неговата интензивност и ползотворност.",
        author: "Александър Стамболийски"
    }
];

    let arrayIndex = Math.floor(Math.random() * quotes.length);
    document.getElementById("quotes").innerHTML = quotes[arrayIndex].quote;
    document.getElementById("author").innerHTML = quotes[arrayIndex].author;
}
window.onload = function() {
    generateQuote();
    document.getElementById("btn").addEventListener('click', generateQuote);
}